Autodesk.Revit.DB.SATImportOptions.#ctor(Autodesk.Revit.DB.SATImportOptions)
Constructs a new instance of SATImportOptions as a copy of the import options.
option:
The SAT options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.SATImportOptions.#ctor
Constructs a new instance of SATImportOptions with default values of all properties.
Since:
2014

Autodesk.Revit.DB.SATImportOptions
The import options used to import SAT format files.
Since:
2014